   - [#   2] AOR __future__: 
--------------------------------------------------------------------------------
  100:         
  101:         return self.mandatory
  102:     
  103:     def __repr__(self):
- 104:         return '_Feature' + repr((self.optional, \
+ 104:         return '_Feature' - repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00981 s] survived

   - [#   3] CDI __future__: 
--------------------------------------------------------------------------------
   77: CO_FUTURE_GENERATOR_STOP = 524288
   78: CO_FUTURE_ANNOTATIONS = 1048576
   79: 
   80: class _Feature:
-  81:     def __init__(self, optionalRelease, mandatoryRelease, compiler_flag):
-  82:         self.optional = optionalRelease
-  83:         self.mandatory = mandatoryRelease
-  84:         self.compiler_flag = compiler_flag
-  85:     
+  81:     @classmethod
+  82:     def __init__(self, optionalRelease, mandatoryRelease, compiler_flag):
+  83:         self.optional = optionalRelease
+  84:         self.mandatory = mandatoryRelease
+  85:         self.compiler_flag = compiler_flag
   86:     def getOptionalRelease(self):
   87:         '''Return first release in which this feature was recognized.
   88: 
   89:         This is a 5-tuple, of the same form as sys.version_info.
--------------------------------------------------------------------------------
[0.00850 s] survived

   - [#   4] CDI __future__: 
--------------------------------------------------------------------------------
   82:         self.optional = optionalRelease
   83:         self.mandatory = mandatoryRelease
   84:         self.compiler_flag = compiler_flag
   85:     
-  86:     def getOptionalRelease(self):
-  87:         '''Return first release in which this feature was recognized.
-  88: 
-  89:         This is a 5-tuple, of the same form as sys.version_info.
-  90:         '''
-  91:         
-  92:         return self.optional
-  93:     
+  86:     @classmethod
+  87:     def getOptionalRelease(self):
+  88:         '''Return first release in which this feature was recognized.
+  89: 
+  90:         This is a 5-tuple, of the same form as sys.version_info.
+  91:         '''
+  92:         
+  93:         return self.optional
   94:     def getMandatoryRelease(self):
   95:         '''Return release in which this feature will become mandatory.
   96: 
   97:         This is a 5-tuple, of the same form as sys.version_info, or, if
--------------------------------------------------------------------------------
[0.00837 s] killed by test_attributes (test___future__.FutureTest)

   - [#   5] CDI __future__: 
--------------------------------------------------------------------------------
   90:         '''
   91:         
   92:         return self.optional
   93:     
-  94:     def getMandatoryRelease(self):
-  95:         '''Return release in which this feature will become mandatory.
-  96: 
-  97:         This is a 5-tuple, of the same form as sys.version_info, or, if
-  98:         the feature was dropped, is None.
-  99:         '''
- 100:         
- 101:         return self.mandatory
- 102:     
+  94:     @classmethod
+  95:     def getMandatoryRelease(self):
+  96:         '''Return release in which this feature will become mandatory.
+  97: 
+  98:         This is a 5-tuple, of the same form as sys.version_info, or, if
+  99:         the feature was dropped, is None.
+ 100:         '''
+ 101:         
+ 102:         return self.mandatory
  103:     def __repr__(self):
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
--------------------------------------------------------------------------------
[0.00835 s] killed by test_attributes (test___future__.FutureTest)

   - [#   6] CDI __future__: 
--------------------------------------------------------------------------------
   99:         '''
  100:         
  101:         return self.mandatory
  102:     
- 103:     def __repr__(self):
- 104:         return '_Feature' + repr((self.optional, \
- 105:             self.mandatory, \
- 106:             self.compiler_flag))
- 107: 
+ 103:     @classmethod
+ 104:     def __repr__(self):
+ 105:         return '_Feature' + repr((self.optional, \
+ 106:             self.mandatory, \
+ 107:             self.compiler_flag))
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
--------------------------------------------------------------------------------
[0.00794 s] survived

   - [#   7] CRP __future__: 
--------------------------------------------------------------------------------
   47: No feature line is ever to be deleted from this file.
   48: '''
   49: 
   50: all_feature_names = [\
-  51:     'nested_scopes', \
+  51:     'mutpy', \
   52:     'generators', \
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
--------------------------------------------------------------------------------
[0.00839 s] survived

   - [#   8] CRP __future__: 
--------------------------------------------------------------------------------
   47: No feature line is ever to be deleted from this file.
   48: '''
   49: 
   50: all_feature_names = [\
-  51:     'nested_scopes', \
+  51:     '', \
   52:     'generators', \
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
--------------------------------------------------------------------------------
[0.00831 s] survived

   - [#   9] CRP __future__: 
--------------------------------------------------------------------------------
   48: '''
   49: 
   50: all_feature_names = [\
   51:     'nested_scopes', \
-  52:     'generators', \
+  52:     'mutpy', \
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
--------------------------------------------------------------------------------
[0.00837 s] survived

   - [#  10] CRP __future__: 
--------------------------------------------------------------------------------
   48: '''
   49: 
   50: all_feature_names = [\
   51:     'nested_scopes', \
-  52:     'generators', \
+  52:     '', \
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
--------------------------------------------------------------------------------
[0.00857 s] survived

   - [#  11] CRP __future__: 
--------------------------------------------------------------------------------
   49: 
   50: all_feature_names = [\
   51:     'nested_scopes', \
   52:     'generators', \
-  53:     'division', \
+  53:     'mutpy', \
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
--------------------------------------------------------------------------------
[0.00874 s] survived

   - [#  12] CRP __future__: 
--------------------------------------------------------------------------------
   49: 
   50: all_feature_names = [\
   51:     'nested_scopes', \
   52:     'generators', \
-  53:     'division', \
+  53:     '', \
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
--------------------------------------------------------------------------------
[0.00797 s] survived

   - [#  13] CRP __future__: 
--------------------------------------------------------------------------------
   50: all_feature_names = [\
   51:     'nested_scopes', \
   52:     'generators', \
   53:     'division', \
-  54:     'absolute_import', \
+  54:     'mutpy', \
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
--------------------------------------------------------------------------------
[0.00787 s] survived

   - [#  14] CRP __future__: 
--------------------------------------------------------------------------------
   50: all_feature_names = [\
   51:     'nested_scopes', \
   52:     'generators', \
   53:     'division', \
-  54:     'absolute_import', \
+  54:     '', \
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
--------------------------------------------------------------------------------
[0.00865 s] survived

   - [#  15] CRP __future__: 
--------------------------------------------------------------------------------
   51:     'nested_scopes', \
   52:     'generators', \
   53:     'division', \
   54:     'absolute_import', \
-  55:     'with_statement', \
+  55:     'mutpy', \
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
--------------------------------------------------------------------------------
[0.00819 s] survived

   - [#  16] CRP __future__: 
--------------------------------------------------------------------------------
   51:     'nested_scopes', \
   52:     'generators', \
   53:     'division', \
   54:     'absolute_import', \
-  55:     'with_statement', \
+  55:     '', \
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
--------------------------------------------------------------------------------
[0.00877 s] survived

   - [#  17] CRP __future__: 
--------------------------------------------------------------------------------
   52:     'generators', \
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
-  56:     'print_function', \
+  56:     'mutpy', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
   60:     'annotations']
--------------------------------------------------------------------------------
[0.00846 s] survived

   - [#  18] CRP __future__: 
--------------------------------------------------------------------------------
   52:     'generators', \
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
-  56:     'print_function', \
+  56:     '', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
   60:     'annotations']
--------------------------------------------------------------------------------
[0.00837 s] survived

   - [#  19] CRP __future__: 
--------------------------------------------------------------------------------
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
-  57:     'unicode_literals', \
+  57:     'mutpy', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
   60:     'annotations']
   61: 
--------------------------------------------------------------------------------
[0.00829 s] survived

   - [#  20] CRP __future__: 
--------------------------------------------------------------------------------
   53:     'division', \
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
-  57:     'unicode_literals', \
+  57:     '', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
   60:     'annotations']
   61: 
--------------------------------------------------------------------------------
[0.00825 s] survived

   - [#  21] CRP __future__: 
--------------------------------------------------------------------------------
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
-  58:     'barry_as_FLUFL', \
+  58:     'mutpy', \
   59:     'generator_stop', \
   60:     'annotations']
   61: 
   62: 
--------------------------------------------------------------------------------
[0.00856 s] survived

   - [#  22] CRP __future__: 
--------------------------------------------------------------------------------
   54:     'absolute_import', \
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
-  58:     'barry_as_FLUFL', \
+  58:     '', \
   59:     'generator_stop', \
   60:     'annotations']
   61: 
   62: 
--------------------------------------------------------------------------------
[0.00798 s] survived

   - [#  23] CRP __future__: 
--------------------------------------------------------------------------------
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
-  59:     'generator_stop', \
+  59:     'mutpy', \
   60:     'annotations']
   61: 
   62: 
   63: __all__ = ['all_feature_names'] + all_feature_names
--------------------------------------------------------------------------------
[0.00870 s] survived

   - [#  24] CRP __future__: 
--------------------------------------------------------------------------------
   55:     'with_statement', \
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
-  59:     'generator_stop', \
+  59:     '', \
   60:     'annotations']
   61: 
   62: 
   63: __all__ = ['all_feature_names'] + all_feature_names
--------------------------------------------------------------------------------
[0.00850 s] survived

   - [#  25] CRP __future__: 
--------------------------------------------------------------------------------
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
-  60:     'annotations']
+  60:     'mutpy']
   61: 
   62: 
   63: __all__ = ['all_feature_names'] + all_feature_names
   64: 
--------------------------------------------------------------------------------
[0.00836 s] survived

   - [#  26] CRP __future__: 
--------------------------------------------------------------------------------
   56:     'print_function', \
   57:     'unicode_literals', \
   58:     'barry_as_FLUFL', \
   59:     'generator_stop', \
-  60:     'annotations']
+  60:     '']
   61: 
   62: 
   63: __all__ = ['all_feature_names'] + all_feature_names
   64: 
--------------------------------------------------------------------------------
[0.00868 s] survived

   - [#  27] CRP __future__: 
--------------------------------------------------------------------------------
   59:     'generator_stop', \
   60:     'annotations']
   61: 
   62: 
-  63: __all__ = ['all_feature_names'] + all_feature_names
+  63: __all__ = ['mutpy'] + all_feature_names
   64: 
   65: 
   66: 
   67: 
--------------------------------------------------------------------------------
[0.00866 s] survived

   - [#  28] CRP __future__: 
--------------------------------------------------------------------------------
   59:     'generator_stop', \
   60:     'annotations']
   61: 
   62: 
-  63: __all__ = ['all_feature_names'] + all_feature_names
+  63: __all__ = [''] + all_feature_names
   64: 
   65: 
   66: 
   67: 
--------------------------------------------------------------------------------
[0.00825 s] survived

   - [#  29] CRP __future__: 
--------------------------------------------------------------------------------
   65: 
   66: 
   67: 
   68: 
-  69: CO_NESTED = 16
+  69: CO_NESTED = 17
   70: CO_GENERATOR_ALLOWED = 0
   71: CO_FUTURE_DIVISION = 8192
   72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
   73: CO_FUTURE_WITH_STATEMENT = 32768
--------------------------------------------------------------------------------
[0.00906 s] killed by test_attributes (test___future__.FutureTest)

   - [#  30] CRP __future__: 
--------------------------------------------------------------------------------
   66: 
   67: 
   68: 
   69: CO_NESTED = 16
-  70: CO_GENERATOR_ALLOWED = 0
+  70: CO_GENERATOR_ALLOWED = 1
   71: CO_FUTURE_DIVISION = 8192
   72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
   73: CO_FUTURE_WITH_STATEMENT = 32768
   74: CO_FUTURE_PRINT_FUNCTION = 65536
--------------------------------------------------------------------------------
[0.00931 s] killed by test_attributes (test___future__.FutureTest)

   - [#  31] CRP __future__: 
--------------------------------------------------------------------------------
   67: 
   68: 
   69: CO_NESTED = 16
   70: CO_GENERATOR_ALLOWED = 0
-  71: CO_FUTURE_DIVISION = 8192
+  71: CO_FUTURE_DIVISION = 8193
   72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
   73: CO_FUTURE_WITH_STATEMENT = 32768
   74: CO_FUTURE_PRINT_FUNCTION = 65536
   75: CO_FUTURE_UNICODE_LITERALS = 131072
--------------------------------------------------------------------------------
[0.00932 s] killed by test_attributes (test___future__.FutureTest)

   - [#  32] CRP __future__: 
--------------------------------------------------------------------------------
   68: 
   69: CO_NESTED = 16
   70: CO_GENERATOR_ALLOWED = 0
   71: CO_FUTURE_DIVISION = 8192
-  72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
+  72: CO_FUTURE_ABSOLUTE_IMPORT = 16385
   73: CO_FUTURE_WITH_STATEMENT = 32768
   74: CO_FUTURE_PRINT_FUNCTION = 65536
   75: CO_FUTURE_UNICODE_LITERALS = 131072
   76: CO_FUTURE_BARRY_AS_BDFL = 262144
--------------------------------------------------------------------------------
[0.00869 s] killed by test_attributes (test___future__.FutureTest)

   - [#  33] CRP __future__: 
--------------------------------------------------------------------------------
   69: CO_NESTED = 16
   70: CO_GENERATOR_ALLOWED = 0
   71: CO_FUTURE_DIVISION = 8192
   72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
-  73: CO_FUTURE_WITH_STATEMENT = 32768
+  73: CO_FUTURE_WITH_STATEMENT = 32769
   74: CO_FUTURE_PRINT_FUNCTION = 65536
   75: CO_FUTURE_UNICODE_LITERALS = 131072
   76: CO_FUTURE_BARRY_AS_BDFL = 262144
   77: CO_FUTURE_GENERATOR_STOP = 524288
--------------------------------------------------------------------------------
[0.00914 s] killed by test_attributes (test___future__.FutureTest)

   - [#  34] CRP __future__: 
--------------------------------------------------------------------------------
   70: CO_GENERATOR_ALLOWED = 0
   71: CO_FUTURE_DIVISION = 8192
   72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
   73: CO_FUTURE_WITH_STATEMENT = 32768
-  74: CO_FUTURE_PRINT_FUNCTION = 65536
+  74: CO_FUTURE_PRINT_FUNCTION = 65537
   75: CO_FUTURE_UNICODE_LITERALS = 131072
   76: CO_FUTURE_BARRY_AS_BDFL = 262144
   77: CO_FUTURE_GENERATOR_STOP = 524288
   78: CO_FUTURE_ANNOTATIONS = 1048576
--------------------------------------------------------------------------------
[0.00890 s] killed by test_attributes (test___future__.FutureTest)

   - [#  35] CRP __future__: 
--------------------------------------------------------------------------------
   71: CO_FUTURE_DIVISION = 8192
   72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
   73: CO_FUTURE_WITH_STATEMENT = 32768
   74: CO_FUTURE_PRINT_FUNCTION = 65536
-  75: CO_FUTURE_UNICODE_LITERALS = 131072
+  75: CO_FUTURE_UNICODE_LITERALS = 131073
   76: CO_FUTURE_BARRY_AS_BDFL = 262144
   77: CO_FUTURE_GENERATOR_STOP = 524288
   78: CO_FUTURE_ANNOTATIONS = 1048576
   79: 
--------------------------------------------------------------------------------
[0.00884 s] killed by test_attributes (test___future__.FutureTest)

   - [#  36] CRP __future__: 
--------------------------------------------------------------------------------
   72: CO_FUTURE_ABSOLUTE_IMPORT = 16384
   73: CO_FUTURE_WITH_STATEMENT = 32768
   74: CO_FUTURE_PRINT_FUNCTION = 65536
   75: CO_FUTURE_UNICODE_LITERALS = 131072
-  76: CO_FUTURE_BARRY_AS_BDFL = 262144
+  76: CO_FUTURE_BARRY_AS_BDFL = 262145
   77: CO_FUTURE_GENERATOR_STOP = 524288
   78: CO_FUTURE_ANNOTATIONS = 1048576
   79: 
   80: class _Feature:
--------------------------------------------------------------------------------
[0.00900 s] killed by test_attributes (test___future__.FutureTest)

   - [#  37] CRP __future__: 
--------------------------------------------------------------------------------
   73: CO_FUTURE_WITH_STATEMENT = 32768
   74: CO_FUTURE_PRINT_FUNCTION = 65536
   75: CO_FUTURE_UNICODE_LITERALS = 131072
   76: CO_FUTURE_BARRY_AS_BDFL = 262144
-  77: CO_FUTURE_GENERATOR_STOP = 524288
+  77: CO_FUTURE_GENERATOR_STOP = 524289
   78: CO_FUTURE_ANNOTATIONS = 1048576
   79: 
   80: class _Feature:
   81:     def __init__(self, optionalRelease, mandatoryRelease, compiler_flag):
--------------------------------------------------------------------------------
[0.00929 s] killed by test_attributes (test___future__.FutureTest)

   - [#  38] CRP __future__: 
--------------------------------------------------------------------------------
   74: CO_FUTURE_PRINT_FUNCTION = 65536
   75: CO_FUTURE_UNICODE_LITERALS = 131072
   76: CO_FUTURE_BARRY_AS_BDFL = 262144
   77: CO_FUTURE_GENERATOR_STOP = 524288
-  78: CO_FUTURE_ANNOTATIONS = 1048576
+  78: CO_FUTURE_ANNOTATIONS = 1048577
   79: 
   80: class _Feature:
   81:     def __init__(self, optionalRelease, mandatoryRelease, compiler_flag):
   82:         self.optional = optionalRelease
--------------------------------------------------------------------------------
[0.00872 s] killed by test_attributes (test___future__.FutureTest)

   - [#  39] CRP __future__: 
--------------------------------------------------------------------------------
  100:         
  101:         return self.mandatory
  102:     
  103:     def __repr__(self):
- 104:         return '_Feature' + repr((self.optional, \
+ 104:         return 'mutpy' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00823 s] survived

   - [#  40] CRP __future__: 
--------------------------------------------------------------------------------
  100:         
  101:         return self.mandatory
  102:     
  103:     def __repr__(self):
- 104:         return '_Feature' + repr((self.optional, \
+ 104:         return '' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00899 s] survived

   - [#  41] CRP __future__: 
--------------------------------------------------------------------------------
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
- 108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
+ 108: nested_scopes = _Feature((3, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00875 s] killed by test_attributes (test___future__.FutureTest)

   - [#  42] CRP __future__: 
--------------------------------------------------------------------------------
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
- 108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
+ 108: nested_scopes = _Feature((2, 2, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00986 s] killed by test_attributes (test___future__.FutureTest)

   - [#  43] CRP __future__: 
--------------------------------------------------------------------------------
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
- 108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
+ 108: nested_scopes = _Feature((2, 1, 1, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00857 s] survived

   - [#  44] CRP __future__: 
--------------------------------------------------------------------------------
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
- 108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
+ 108: nested_scopes = _Feature((2, 1, 0, 'mutpy', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00881 s] killed by test_attributes (test___future__.FutureTest)

   - [#  45] CRP __future__: 
--------------------------------------------------------------------------------
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
- 108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
+ 108: nested_scopes = _Feature((2, 1, 0, '', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00882 s] killed by test_attributes (test___future__.FutureTest)

   - [#  46] CRP __future__: 
--------------------------------------------------------------------------------
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
- 108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
+ 108: nested_scopes = _Feature((2, 1, 0, 'beta', 2), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00869 s] survived

   - [#  47] CRP __future__: 
--------------------------------------------------------------------------------
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
- 109:     (2, 2, 0, 'alpha', 0), 
+ 109:     (3, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
--------------------------------------------------------------------------------
[0.00817 s] survived

   - [#  48] CRP __future__: 
--------------------------------------------------------------------------------
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
- 109:     (2, 2, 0, 'alpha', 0), 
+ 109:     (2, 3, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
--------------------------------------------------------------------------------
[0.00851 s] survived

   - [#  49] CRP __future__: 
--------------------------------------------------------------------------------
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
- 109:     (2, 2, 0, 'alpha', 0), 
+ 109:     (2, 2, 1, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
--------------------------------------------------------------------------------
[0.00814 s] survived

   - [#  50] CRP __future__: 
--------------------------------------------------------------------------------
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
- 109:     (2, 2, 0, 'alpha', 0), 
+ 109:     (2, 2, 0, 'mutpy', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
--------------------------------------------------------------------------------
[0.00821 s] killed by test_attributes (test___future__.FutureTest)

   - [#  51] CRP __future__: 
--------------------------------------------------------------------------------
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
- 109:     (2, 2, 0, 'alpha', 0), 
+ 109:     (2, 2, 0, '', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
--------------------------------------------------------------------------------
[0.00877 s] killed by test_attributes (test___future__.FutureTest)

   - [#  52] CRP __future__: 
--------------------------------------------------------------------------------
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
- 109:     (2, 2, 0, 'alpha', 0), 
+ 109:     (2, 2, 0, 'alpha', 1), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
--------------------------------------------------------------------------------
[0.00813 s] survived
