   - [#  53] CRP __future__: 
--------------------------------------------------------------------------------
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
- 112: generators = _Feature((2, 2, 0, 'alpha', 1), 
+ 112: generators = _Feature((3, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00836 s] killed by test_attributes (test___future__.FutureTest)

   - [#  54] CRP __future__: 
--------------------------------------------------------------------------------
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
- 112: generators = _Feature((2, 2, 0, 'alpha', 1), 
+ 112: generators = _Feature((2, 3, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00832 s] survived

   - [#  55] CRP __future__: 
--------------------------------------------------------------------------------
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
- 112: generators = _Feature((2, 2, 0, 'alpha', 1), 
+ 112: generators = _Feature((2, 2, 1, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00802 s] survived

   - [#  56] CRP __future__: 
--------------------------------------------------------------------------------
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
- 112: generators = _Feature((2, 2, 0, 'alpha', 1), 
+ 112: generators = _Feature((2, 2, 0, 'mutpy', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00913 s] killed by test_attributes (test___future__.FutureTest)

   - [#  57] CRP __future__: 
--------------------------------------------------------------------------------
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
- 112: generators = _Feature((2, 2, 0, 'alpha', 1), 
+ 112: generators = _Feature((2, 2, 0, '', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00861 s] killed by test_attributes (test___future__.FutureTest)

   - [#  58] CRP __future__: 
--------------------------------------------------------------------------------
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
- 112: generators = _Feature((2, 2, 0, 'alpha', 1), 
+ 112: generators = _Feature((2, 2, 0, 'alpha', 2), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00866 s] survived

   - [#  59] CRP __future__: 
--------------------------------------------------------------------------------
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
- 113:     (2, 3, 0, 'final', 0), 
+ 113:     (3, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00852 s] survived

   - [#  60] CRP __future__: 
--------------------------------------------------------------------------------
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
- 113:     (2, 3, 0, 'final', 0), 
+ 113:     (2, 4, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00822 s] survived

   - [#  61] CRP __future__: 
--------------------------------------------------------------------------------
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
- 113:     (2, 3, 0, 'final', 0), 
+ 113:     (2, 3, 1, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00857 s] survived

   - [#  62] CRP __future__: 
--------------------------------------------------------------------------------
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
- 113:     (2, 3, 0, 'final', 0), 
+ 113:     (2, 3, 0, 'mutpy', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00862 s] killed by test_attributes (test___future__.FutureTest)

   - [#  63] CRP __future__: 
--------------------------------------------------------------------------------
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
- 113:     (2, 3, 0, 'final', 0), 
+ 113:     (2, 3, 0, '', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00894 s] killed by test_attributes (test___future__.FutureTest)

   - [#  64] CRP __future__: 
--------------------------------------------------------------------------------
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
- 113:     (2, 3, 0, 'final', 0), 
+ 113:     (2, 3, 0, 'final', 1), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00822 s] survived

   - [#  65] CRP __future__: 
--------------------------------------------------------------------------------
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
- 116: division = _Feature((2, 2, 0, 'alpha', 2), 
+ 116: division = _Feature((3, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00864 s] killed by test_attributes (test___future__.FutureTest)

   - [#  66] CRP __future__: 
--------------------------------------------------------------------------------
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
- 116: division = _Feature((2, 2, 0, 'alpha', 2), 
+ 116: division = _Feature((2, 3, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00841 s] survived

   - [#  67] CRP __future__: 
--------------------------------------------------------------------------------
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
- 116: division = _Feature((2, 2, 0, 'alpha', 2), 
+ 116: division = _Feature((2, 2, 1, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00875 s] survived

   - [#  68] CRP __future__: 
--------------------------------------------------------------------------------
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
- 116: division = _Feature((2, 2, 0, 'alpha', 2), 
+ 116: division = _Feature((2, 2, 0, 'mutpy', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00842 s] killed by test_attributes (test___future__.FutureTest)

   - [#  69] CRP __future__: 
--------------------------------------------------------------------------------
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
- 116: division = _Feature((2, 2, 0, 'alpha', 2), 
+ 116: division = _Feature((2, 2, 0, '', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00888 s] killed by test_attributes (test___future__.FutureTest)

   - [#  70] CRP __future__: 
--------------------------------------------------------------------------------
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
- 116: division = _Feature((2, 2, 0, 'alpha', 2), 
+ 116: division = _Feature((2, 2, 0, 'alpha', 3), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00832 s] survived

   - [#  71] CRP __future__: 
--------------------------------------------------------------------------------
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
- 117:     (3, 0, 0, 'alpha', 0), 
+ 117:     (4, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00795 s] survived

   - [#  72] CRP __future__: 
--------------------------------------------------------------------------------
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
- 117:     (3, 0, 0, 'alpha', 0), 
+ 117:     (3, 1, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00794 s] survived

   - [#  73] CRP __future__: 
--------------------------------------------------------------------------------
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
- 117:     (3, 0, 0, 'alpha', 0), 
+ 117:     (3, 0, 1, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00805 s] survived

   - [#  74] CRP __future__: 
--------------------------------------------------------------------------------
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
- 117:     (3, 0, 0, 'alpha', 0), 
+ 117:     (3, 0, 0, 'mutpy', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00844 s] killed by test_attributes (test___future__.FutureTest)

   - [#  75] CRP __future__: 
--------------------------------------------------------------------------------
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
- 117:     (3, 0, 0, 'alpha', 0), 
+ 117:     (3, 0, 0, '', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00887 s] killed by test_attributes (test___future__.FutureTest)

   - [#  76] CRP __future__: 
--------------------------------------------------------------------------------
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
- 117:     (3, 0, 0, 'alpha', 0), 
+ 117:     (3, 0, 0, 'alpha', 1), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00813 s] survived

   - [#  77] CRP __future__: 
--------------------------------------------------------------------------------
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
- 120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
+ 120: absolute_import = _Feature((3, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00847 s] killed by test_attributes (test___future__.FutureTest)

   - [#  78] CRP __future__: 
--------------------------------------------------------------------------------
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
- 120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
+ 120: absolute_import = _Feature((2, 6, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00868 s] survived

   - [#  79] CRP __future__: 
--------------------------------------------------------------------------------
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
- 120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
+ 120: absolute_import = _Feature((2, 5, 1, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00854 s] survived

   - [#  80] CRP __future__: 
--------------------------------------------------------------------------------
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
- 120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
+ 120: absolute_import = _Feature((2, 5, 0, 'mutpy', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00863 s] killed by test_attributes (test___future__.FutureTest)

   - [#  81] CRP __future__: 
--------------------------------------------------------------------------------
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
- 120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
+ 120: absolute_import = _Feature((2, 5, 0, '', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00907 s] killed by test_attributes (test___future__.FutureTest)

   - [#  82] CRP __future__: 
--------------------------------------------------------------------------------
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
- 120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
+ 120: absolute_import = _Feature((2, 5, 0, 'alpha', 2), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
--------------------------------------------------------------------------------
[0.00839 s] survived

   - [#  83] CRP __future__: 
--------------------------------------------------------------------------------
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
- 121:     (3, 0, 0, 'alpha', 0), 
+ 121:     (4, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00889 s] survived

   - [#  84] CRP __future__: 
--------------------------------------------------------------------------------
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
- 121:     (3, 0, 0, 'alpha', 0), 
+ 121:     (3, 1, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00858 s] survived

   - [#  85] CRP __future__: 
--------------------------------------------------------------------------------
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
- 121:     (3, 0, 0, 'alpha', 0), 
+ 121:     (3, 0, 1, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00843 s] survived

   - [#  86] CRP __future__: 
--------------------------------------------------------------------------------
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
- 121:     (3, 0, 0, 'alpha', 0), 
+ 121:     (3, 0, 0, 'mutpy', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00878 s] killed by test_attributes (test___future__.FutureTest)

   - [#  87] CRP __future__: 
--------------------------------------------------------------------------------
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
- 121:     (3, 0, 0, 'alpha', 0), 
+ 121:     (3, 0, 0, '', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00926 s] killed by test_attributes (test___future__.FutureTest)

   - [#  88] CRP __future__: 
--------------------------------------------------------------------------------
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
- 121:     (3, 0, 0, 'alpha', 0), 
+ 121:     (3, 0, 0, 'alpha', 1), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00894 s] survived

   - [#  89] CRP __future__: 
--------------------------------------------------------------------------------
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
- 124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
+ 124: with_statement = _Feature((3, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00936 s] killed by test_attributes (test___future__.FutureTest)

   - [#  90] CRP __future__: 
--------------------------------------------------------------------------------
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
- 124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
+ 124: with_statement = _Feature((2, 6, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00912 s] killed by test_attributes (test___future__.FutureTest)

   - [#  91] CRP __future__: 
--------------------------------------------------------------------------------
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
- 124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
+ 124: with_statement = _Feature((2, 5, 1, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00976 s] survived

   - [#  92] CRP __future__: 
--------------------------------------------------------------------------------
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
- 124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
+ 124: with_statement = _Feature((2, 5, 0, 'mutpy', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00949 s] killed by test_attributes (test___future__.FutureTest)

   - [#  93] CRP __future__: 
--------------------------------------------------------------------------------
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
- 124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
+ 124: with_statement = _Feature((2, 5, 0, '', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00928 s] killed by test_attributes (test___future__.FutureTest)

   - [#  94] CRP __future__: 
--------------------------------------------------------------------------------
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
- 124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
+ 124: with_statement = _Feature((2, 5, 0, 'alpha', 2), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00870 s] survived

   - [#  95] CRP __future__: 
--------------------------------------------------------------------------------
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
- 125:     (2, 6, 0, 'alpha', 0), 
+ 125:     (3, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00891 s] survived

   - [#  96] CRP __future__: 
--------------------------------------------------------------------------------
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
- 125:     (2, 6, 0, 'alpha', 0), 
+ 125:     (2, 7, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00880 s] survived

   - [#  97] CRP __future__: 
--------------------------------------------------------------------------------
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
- 125:     (2, 6, 0, 'alpha', 0), 
+ 125:     (2, 6, 1, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00900 s] survived

   - [#  98] CRP __future__: 
--------------------------------------------------------------------------------
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
- 125:     (2, 6, 0, 'alpha', 0), 
+ 125:     (2, 6, 0, 'mutpy', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00899 s] killed by test_attributes (test___future__.FutureTest)

   - [#  99] CRP __future__: 
--------------------------------------------------------------------------------
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
- 125:     (2, 6, 0, 'alpha', 0), 
+ 125:     (2, 6, 0, '', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00967 s] killed by test_attributes (test___future__.FutureTest)

   - [# 100] CRP __future__: 
--------------------------------------------------------------------------------
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
- 125:     (2, 6, 0, 'alpha', 0), 
+ 125:     (2, 6, 0, 'alpha', 1), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00878 s] survived

   - [# 101] CRP __future__: 
--------------------------------------------------------------------------------
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
- 128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
+ 128: print_function = _Feature((3, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.01197 s] killed by test_attributes (test___future__.FutureTest)

   - [# 102] CRP __future__: 
--------------------------------------------------------------------------------
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
- 128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
+ 128: print_function = _Feature((2, 7, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00943 s] survived

   - [# 103] CRP __future__: 
--------------------------------------------------------------------------------
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
- 128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
+ 128: print_function = _Feature((2, 6, 1, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00890 s] survived
