   - [# 104] CRP __future__: 
--------------------------------------------------------------------------------
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
- 128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
+ 128: print_function = _Feature((2, 6, 0, 'mutpy', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00987 s] killed by test_attributes (test___future__.FutureTest)

   - [# 105] CRP __future__: 
--------------------------------------------------------------------------------
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
- 128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
+ 128: print_function = _Feature((2, 6, 0, '', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00947 s] killed by test_attributes (test___future__.FutureTest)

   - [# 106] CRP __future__: 
--------------------------------------------------------------------------------
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
- 128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
+ 128: print_function = _Feature((2, 6, 0, 'alpha', 3), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00922 s] survived

   - [# 107] CRP __future__: 
--------------------------------------------------------------------------------
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
- 129:     (3, 0, 0, 'alpha', 0), 
+ 129:     (4, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00866 s] survived

   - [# 108] CRP __future__: 
--------------------------------------------------------------------------------
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
- 129:     (3, 0, 0, 'alpha', 0), 
+ 129:     (3, 1, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00836 s] survived

   - [# 109] CRP __future__: 
--------------------------------------------------------------------------------
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
- 129:     (3, 0, 0, 'alpha', 0), 
+ 129:     (3, 0, 1, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00943 s] survived

   - [# 110] CRP __future__: 
--------------------------------------------------------------------------------
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
- 129:     (3, 0, 0, 'alpha', 0), 
+ 129:     (3, 0, 0, 'mutpy', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00910 s] killed by test_attributes (test___future__.FutureTest)

   - [# 111] CRP __future__: 
--------------------------------------------------------------------------------
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
- 129:     (3, 0, 0, 'alpha', 0), 
+ 129:     (3, 0, 0, '', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00902 s] killed by test_attributes (test___future__.FutureTest)

   - [# 112] CRP __future__: 
--------------------------------------------------------------------------------
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
- 129:     (3, 0, 0, 'alpha', 0), 
+ 129:     (3, 0, 0, 'alpha', 1), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00821 s] survived

   - [# 113] CRP __future__: 
--------------------------------------------------------------------------------
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
- 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
+ 132: unicode_literals = _Feature((3, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.00880 s] killed by test_attributes (test___future__.FutureTest)

   - [# 114] CRP __future__: 
--------------------------------------------------------------------------------
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
- 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
+ 132: unicode_literals = _Feature((2, 7, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.01500 s] survived

   - [# 115] CRP __future__: 
--------------------------------------------------------------------------------
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
- 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
+ 132: unicode_literals = _Feature((2, 6, 1, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.01130 s] survived

   - [# 116] CRP __future__: 
--------------------------------------------------------------------------------
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
- 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
+ 132: unicode_literals = _Feature((2, 6, 0, 'mutpy', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.01079 s] killed by test_attributes (test___future__.FutureTest)

   - [# 117] CRP __future__: 
--------------------------------------------------------------------------------
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
- 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
+ 132: unicode_literals = _Feature((2, 6, 0, '', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.02228 s] killed by test_attributes (test___future__.FutureTest)

   - [# 118] CRP __future__: 
--------------------------------------------------------------------------------
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
- 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
+ 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 3), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
--------------------------------------------------------------------------------
[0.01174 s] survived

   - [# 119] CRP __future__: 
--------------------------------------------------------------------------------
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
- 133:     (3, 0, 0, 'alpha', 0), 
+ 133:     (4, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00932 s] survived

   - [# 120] CRP __future__: 
--------------------------------------------------------------------------------
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
- 133:     (3, 0, 0, 'alpha', 0), 
+ 133:     (3, 1, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.01029 s] survived

   - [# 121] CRP __future__: 
--------------------------------------------------------------------------------
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
- 133:     (3, 0, 0, 'alpha', 0), 
+ 133:     (3, 0, 1, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00872 s] survived

   - [# 122] CRP __future__: 
--------------------------------------------------------------------------------
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
- 133:     (3, 0, 0, 'alpha', 0), 
+ 133:     (3, 0, 0, 'mutpy', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00981 s] killed by test_attributes (test___future__.FutureTest)

   - [# 123] CRP __future__: 
--------------------------------------------------------------------------------
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
- 133:     (3, 0, 0, 'alpha', 0), 
+ 133:     (3, 0, 0, '', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.01413 s] killed by test_attributes (test___future__.FutureTest)

   - [# 124] CRP __future__: 
--------------------------------------------------------------------------------
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
- 133:     (3, 0, 0, 'alpha', 0), 
+ 133:     (3, 0, 0, 'alpha', 1), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.01139 s] survived

   - [# 125] CRP __future__: 
--------------------------------------------------------------------------------
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
- 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
+ 136: barry_as_FLUFL = _Feature((4, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.01575 s] killed by test_attributes (test___future__.FutureTest)

   - [# 126] CRP __future__: 
--------------------------------------------------------------------------------
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
- 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
+ 136: barry_as_FLUFL = _Feature((3, 2, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.01158 s] survived

   - [# 127] CRP __future__: 
--------------------------------------------------------------------------------
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
- 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
+ 136: barry_as_FLUFL = _Feature((3, 1, 1, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00878 s] survived

   - [# 128] CRP __future__: 
--------------------------------------------------------------------------------
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
- 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
+ 136: barry_as_FLUFL = _Feature((3, 1, 0, 'mutpy', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00949 s] killed by test_attributes (test___future__.FutureTest)

   - [# 129] CRP __future__: 
--------------------------------------------------------------------------------
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
- 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
+ 136: barry_as_FLUFL = _Feature((3, 1, 0, '', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00971 s] killed by test_attributes (test___future__.FutureTest)

   - [# 130] CRP __future__: 
--------------------------------------------------------------------------------
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
- 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
+ 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 3), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00878 s] survived

   - [# 131] CRP __future__: 
--------------------------------------------------------------------------------
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
- 137:     (3, 9, 0, 'alpha', 0), 
+ 137:     (4, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00900 s] survived

   - [# 132] CRP __future__: 
--------------------------------------------------------------------------------
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
- 137:     (3, 9, 0, 'alpha', 0), 
+ 137:     (3, 10, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00850 s] survived

   - [# 133] CRP __future__: 
--------------------------------------------------------------------------------
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
- 137:     (3, 9, 0, 'alpha', 0), 
+ 137:     (3, 9, 1, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00937 s] survived

   - [# 134] CRP __future__: 
--------------------------------------------------------------------------------
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
- 137:     (3, 9, 0, 'alpha', 0), 
+ 137:     (3, 9, 0, 'mutpy', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00922 s] killed by test_attributes (test___future__.FutureTest)

   - [# 135] CRP __future__: 
--------------------------------------------------------------------------------
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
- 137:     (3, 9, 0, 'alpha', 0), 
+ 137:     (3, 9, 0, '', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00933 s] killed by test_attributes (test___future__.FutureTest)

   - [# 136] CRP __future__: 
--------------------------------------------------------------------------------
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
- 137:     (3, 9, 0, 'alpha', 0), 
+ 137:     (3, 9, 0, 'alpha', 1), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00936 s] survived

   - [# 137] CRP __future__: 
--------------------------------------------------------------------------------
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
- 140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
+ 140: generator_stop = _Feature((4, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00977 s] killed by test_attributes (test___future__.FutureTest)

   - [# 138] CRP __future__: 
--------------------------------------------------------------------------------
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
- 140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
+ 140: generator_stop = _Feature((3, 6, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00885 s] survived

   - [# 139] CRP __future__: 
--------------------------------------------------------------------------------
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
- 140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
+ 140: generator_stop = _Feature((3, 5, 1, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00894 s] survived

   - [# 140] CRP __future__: 
--------------------------------------------------------------------------------
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
- 140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
+ 140: generator_stop = _Feature((3, 5, 0, 'mutpy', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00947 s] killed by test_attributes (test___future__.FutureTest)

   - [# 141] CRP __future__: 
--------------------------------------------------------------------------------
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
- 140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
+ 140: generator_stop = _Feature((3, 5, 0, '', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00969 s] killed by test_attributes (test___future__.FutureTest)

   - [# 142] CRP __future__: 
--------------------------------------------------------------------------------
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
- 140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
+ 140: generator_stop = _Feature((3, 5, 0, 'beta', 2), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00868 s] survived

   - [# 143] CRP __future__: 
--------------------------------------------------------------------------------
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
- 141:     (3, 7, 0, 'alpha', 0), 
+ 141:     (4, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00872 s] survived

   - [# 144] CRP __future__: 
--------------------------------------------------------------------------------
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
- 141:     (3, 7, 0, 'alpha', 0), 
+ 141:     (3, 8, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00873 s] survived

   - [# 145] CRP __future__: 
--------------------------------------------------------------------------------
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
- 141:     (3, 7, 0, 'alpha', 0), 
+ 141:     (3, 7, 1, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00891 s] survived

   - [# 146] CRP __future__: 
--------------------------------------------------------------------------------
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
- 141:     (3, 7, 0, 'alpha', 0), 
+ 141:     (3, 7, 0, 'mutpy', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00942 s] killed by test_attributes (test___future__.FutureTest)

   - [# 147] CRP __future__: 
--------------------------------------------------------------------------------
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
- 141:     (3, 7, 0, 'alpha', 0), 
+ 141:     (3, 7, 0, '', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00951 s] killed by test_attributes (test___future__.FutureTest)

   - [# 148] CRP __future__: 
--------------------------------------------------------------------------------
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
- 141:     (3, 7, 0, 'alpha', 0), 
+ 141:     (3, 7, 0, 'alpha', 1), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00861 s] survived

   - [# 149] CRP __future__: 
--------------------------------------------------------------------------------
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
- 144: annotations = _Feature((3, 7, 0, 'beta', 1), 
+ 144: annotations = _Feature((4, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00948 s] killed by test_attributes (test___future__.FutureTest)

   - [# 150] CRP __future__: 
--------------------------------------------------------------------------------
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
- 144: annotations = _Feature((3, 7, 0, 'beta', 1), 
+ 144: annotations = _Feature((3, 8, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00863 s] survived

   - [# 151] CRP __future__: 
--------------------------------------------------------------------------------
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
- 144: annotations = _Feature((3, 7, 0, 'beta', 1), 
+ 144: annotations = _Feature((3, 7, 1, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.01450 s] survived

   - [# 152] CRP __future__: 
--------------------------------------------------------------------------------
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
- 144: annotations = _Feature((3, 7, 0, 'beta', 1), 
+ 144: annotations = _Feature((3, 7, 0, 'mutpy', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00943 s] killed by test_attributes (test___future__.FutureTest)

   - [# 153] CRP __future__: 
--------------------------------------------------------------------------------
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
- 144: annotations = _Feature((3, 7, 0, 'beta', 1), 
+ 144: annotations = _Feature((3, 7, 0, '', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.01099 s] killed by test_attributes (test___future__.FutureTest)
