   - [# 154] CRP __future__: 
--------------------------------------------------------------------------------
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
- 144: annotations = _Feature((3, 7, 0, 'beta', 1), 
+ 144: annotations = _Feature((3, 7, 0, 'beta', 2), 
  145:     (4, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00881 s] survived

   - [# 155] CRP __future__: 
--------------------------------------------------------------------------------
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
- 145:     (4, 0, 0, 'alpha', 0), 
+ 145:     (5, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00871 s] survived

   - [# 156] CRP __future__: 
--------------------------------------------------------------------------------
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
- 145:     (4, 0, 0, 'alpha', 0), 
+ 145:     (4, 1, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00914 s] survived

   - [# 157] CRP __future__: 
--------------------------------------------------------------------------------
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
- 145:     (4, 0, 0, 'alpha', 0), 
+ 145:     (4, 0, 1, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00865 s] survived

   - [# 158] CRP __future__: 
--------------------------------------------------------------------------------
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
- 145:     (4, 0, 0, 'alpha', 0), 
+ 145:     (4, 0, 0, 'mutpy', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.01015 s] killed by test_attributes (test___future__.FutureTest)

   - [# 159] CRP __future__: 
--------------------------------------------------------------------------------
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
- 145:     (4, 0, 0, 'alpha', 0), 
+ 145:     (4, 0, 0, '', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00922 s] killed by test_attributes (test___future__.FutureTest)

   - [# 160] CRP __future__: 
--------------------------------------------------------------------------------
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
- 145:     (4, 0, 0, 'alpha', 0), 
+ 145:     (4, 0, 0, 'alpha', 1), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00853 s] survived

   - [# 162] SDI __future__: 
--------------------------------------------------------------------------------
   82:         self.optional = optionalRelease
   83:         self.mandatory = mandatoryRelease
   84:         self.compiler_flag = compiler_flag
   85:     
-  86:     def getOptionalRelease(self):
-  87:         '''Return first release in which this feature was recognized.
-  88: 
-  89:         This is a 5-tuple, of the same form as sys.version_info.
-  90:         '''
-  91:         
-  92:         return self.optional
-  93:     
+  86:     @staticmethod
+  87:     def getOptionalRelease(self):
+  88:         '''Return first release in which this feature was recognized.
+  89: 
+  90:         This is a 5-tuple, of the same form as sys.version_info.
+  91:         '''
+  92:         
+  93:         return self.optional
   94:     def getMandatoryRelease(self):
   95:         '''Return release in which this feature will become mandatory.
   96: 
   97:         This is a 5-tuple, of the same form as sys.version_info, or, if
--------------------------------------------------------------------------------
[1.00728 s] timeout

   - [# 163] SDI __future__: 
--------------------------------------------------------------------------------
   90:         '''
   91:         
   92:         return self.optional
   93:     
-  94:     def getMandatoryRelease(self):
-  95:         '''Return release in which this feature will become mandatory.
-  96: 
-  97:         This is a 5-tuple, of the same form as sys.version_info, or, if
-  98:         the feature was dropped, is None.
-  99:         '''
- 100:         
- 101:         return self.mandatory
- 102:     
+  94:     @staticmethod
+  95:     def getMandatoryRelease(self):
+  96:         '''Return release in which this feature will become mandatory.
+  97: 
+  98:         This is a 5-tuple, of the same form as sys.version_info, or, if
+  99:         the feature was dropped, is None.
+ 100:         '''
+ 101:         
+ 102:         return self.mandatory
  103:     def __repr__(self):
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
--------------------------------------------------------------------------------
[1.00725 s] timeout

   - [# 164] SDI __future__: 
--------------------------------------------------------------------------------
   99:         '''
  100:         
  101:         return self.mandatory
  102:     
- 103:     def __repr__(self):
- 104:         return '_Feature' + repr((self.optional, \
- 105:             self.mandatory, \
- 106:             self.compiler_flag))
- 107: 
+ 103:     @staticmethod
+ 104:     def __repr__(self):
+ 105:         return '_Feature' + repr((self.optional, \
+ 106:             self.mandatory, \
+ 107:             self.compiler_flag))
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
--------------------------------------------------------------------------------
[0.01396 s] survived

   - [# 166] SDL __future__: 
--------------------------------------------------------------------------------
   59:     'generator_stop', \
   60:     'annotations']
   61: 
   62: 
-  63: __all__ = ['all_feature_names'] + all_feature_names
+  63: pass
   64: 
   65: 
   66: 
   67: 
--------------------------------------------------------------------------------
[0.02497 s] survived

   - [# 177] SDL __future__: 
--------------------------------------------------------------------------------
   78: CO_FUTURE_ANNOTATIONS = 1048576
   79: 
   80: class _Feature:
   81:     def __init__(self, optionalRelease, mandatoryRelease, compiler_flag):
-  82:         self.optional = optionalRelease
+  82:         pass
   83:         self.mandatory = mandatoryRelease
   84:         self.compiler_flag = compiler_flag
   85:     
   86:     def getOptionalRelease(self):
--------------------------------------------------------------------------------
[0.01019 s] killed by test_attributes (test___future__.FutureTest)

   - [# 178] SDL __future__: 
--------------------------------------------------------------------------------
   79: 
   80: class _Feature:
   81:     def __init__(self, optionalRelease, mandatoryRelease, compiler_flag):
   82:         self.optional = optionalRelease
-  83:         self.mandatory = mandatoryRelease
+  83:         pass
   84:         self.compiler_flag = compiler_flag
   85:     
   86:     def getOptionalRelease(self):
   87:         '''Return first release in which this feature was recognized.
--------------------------------------------------------------------------------
[0.00891 s] killed by test_attributes (test___future__.FutureTest)

   - [# 179] SDL __future__: 
--------------------------------------------------------------------------------
   80: class _Feature:
   81:     def __init__(self, optionalRelease, mandatoryRelease, compiler_flag):
   82:         self.optional = optionalRelease
   83:         self.mandatory = mandatoryRelease
-  84:         self.compiler_flag = compiler_flag
+  84:         pass
   85:     
   86:     def getOptionalRelease(self):
   87:         '''Return first release in which this feature was recognized.
   88: 
--------------------------------------------------------------------------------
[0.00876 s] killed by test_attributes (test___future__.FutureTest)

   - [# 180] SDL __future__: 
--------------------------------------------------------------------------------
   88: 
   89:         This is a 5-tuple, of the same form as sys.version_info.
   90:         '''
   91:         
-  92:         return self.optional
+  92:         pass
   93:     
   94:     def getMandatoryRelease(self):
   95:         '''Return release in which this feature will become mandatory.
   96: 
--------------------------------------------------------------------------------
[0.00849 s] killed by test_attributes (test___future__.FutureTest)

   - [# 181] SDL __future__: 
--------------------------------------------------------------------------------
   97:         This is a 5-tuple, of the same form as sys.version_info, or, if
   98:         the feature was dropped, is None.
   99:         '''
  100:         
- 101:         return self.mandatory
+ 101:         pass
  102:     
  103:     def __repr__(self):
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
--------------------------------------------------------------------------------
[0.00853 s] survived

   - [# 182] SDL __future__: 
--------------------------------------------------------------------------------
  100:         
  101:         return self.mandatory
  102:     
  103:     def __repr__(self):
- 104:         return '_Feature' + repr((self.optional, \
- 105:             self.mandatory, \
- 106:             self.compiler_flag))
+ 104:         pass
+ 105: 
+ 106: 
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
--------------------------------------------------------------------------------
[0.00818 s] survived

   - [# 183] SDL __future__: 
--------------------------------------------------------------------------------
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
- 108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
- 109:     (2, 2, 0, 'alpha', 0), 
- 110:     CO_NESTED)
+ 108: pass
+ 109: 
+ 110: 
  111: 
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
--------------------------------------------------------------------------------
[0.00837 s] killed by test_attributes (test___future__.FutureTest)

   - [# 184] SDL __future__: 
--------------------------------------------------------------------------------
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
  111: 
- 112: generators = _Feature((2, 2, 0, 'alpha', 1), 
- 113:     (2, 3, 0, 'final', 0), 
- 114:     CO_GENERATOR_ALLOWED)
+ 112: pass
+ 113: 
+ 114: 
  115: 
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
--------------------------------------------------------------------------------
[0.00855 s] killed by test_attributes (test___future__.FutureTest)

   - [# 185] SDL __future__: 
--------------------------------------------------------------------------------
  112: generators = _Feature((2, 2, 0, 'alpha', 1), 
  113:     (2, 3, 0, 'final', 0), 
  114:     CO_GENERATOR_ALLOWED)
  115: 
- 116: division = _Feature((2, 2, 0, 'alpha', 2), 
- 117:     (3, 0, 0, 'alpha', 0), 
- 118:     CO_FUTURE_DIVISION)
+ 116: pass
+ 117: 
+ 118: 
  119: 
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
--------------------------------------------------------------------------------
[0.00891 s] killed by test_attributes (test___future__.FutureTest)

   - [# 186] SDL __future__: 
--------------------------------------------------------------------------------
  116: division = _Feature((2, 2, 0, 'alpha', 2), 
  117:     (3, 0, 0, 'alpha', 0), 
  118:     CO_FUTURE_DIVISION)
  119: 
- 120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
- 121:     (3, 0, 0, 'alpha', 0), 
- 122:     CO_FUTURE_ABSOLUTE_IMPORT)
+ 120: pass
+ 121: 
+ 122: 
  123: 
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
--------------------------------------------------------------------------------
[0.00885 s] killed by test_attributes (test___future__.FutureTest)

   - [# 187] SDL __future__: 
--------------------------------------------------------------------------------
  120: absolute_import = _Feature((2, 5, 0, 'alpha', 1), 
  121:     (3, 0, 0, 'alpha', 0), 
  122:     CO_FUTURE_ABSOLUTE_IMPORT)
  123: 
- 124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
- 125:     (2, 6, 0, 'alpha', 0), 
- 126:     CO_FUTURE_WITH_STATEMENT)
+ 124: pass
+ 125: 
+ 126: 
  127: 
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
--------------------------------------------------------------------------------
[0.00840 s] killed by test_attributes (test___future__.FutureTest)

   - [# 188] SDL __future__: 
--------------------------------------------------------------------------------
  124: with_statement = _Feature((2, 5, 0, 'alpha', 1), 
  125:     (2, 6, 0, 'alpha', 0), 
  126:     CO_FUTURE_WITH_STATEMENT)
  127: 
- 128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
- 129:     (3, 0, 0, 'alpha', 0), 
- 130:     CO_FUTURE_PRINT_FUNCTION)
+ 128: pass
+ 129: 
+ 130: 
  131: 
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
--------------------------------------------------------------------------------
[0.00845 s] killed by test_attributes (test___future__.FutureTest)

   - [# 189] SDL __future__: 
--------------------------------------------------------------------------------
  128: print_function = _Feature((2, 6, 0, 'alpha', 2), 
  129:     (3, 0, 0, 'alpha', 0), 
  130:     CO_FUTURE_PRINT_FUNCTION)
  131: 
- 132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
- 133:     (3, 0, 0, 'alpha', 0), 
- 134:     CO_FUTURE_UNICODE_LITERALS)
+ 132: pass
+ 133: 
+ 134: 
  135: 
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
--------------------------------------------------------------------------------
[0.00888 s] killed by test_attributes (test___future__.FutureTest)

   - [# 190] SDL __future__: 
--------------------------------------------------------------------------------
  132: unicode_literals = _Feature((2, 6, 0, 'alpha', 2), 
  133:     (3, 0, 0, 'alpha', 0), 
  134:     CO_FUTURE_UNICODE_LITERALS)
  135: 
- 136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
- 137:     (3, 9, 0, 'alpha', 0), 
- 138:     CO_FUTURE_BARRY_AS_BDFL)
+ 136: pass
+ 137: 
+ 138: 
  139: 
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
--------------------------------------------------------------------------------
[0.00852 s] killed by test_attributes (test___future__.FutureTest)

   - [# 191] SDL __future__: 
--------------------------------------------------------------------------------
  136: barry_as_FLUFL = _Feature((3, 1, 0, 'alpha', 2), 
  137:     (3, 9, 0, 'alpha', 0), 
  138:     CO_FUTURE_BARRY_AS_BDFL)
  139: 
- 140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
- 141:     (3, 7, 0, 'alpha', 0), 
- 142:     CO_FUTURE_GENERATOR_STOP)
+ 140: pass
+ 141: 
+ 142: 
  143: 
  144: annotations = _Feature((3, 7, 0, 'beta', 1), 
  145:     (4, 0, 0, 'alpha', 0), 
  146:     CO_FUTURE_ANNOTATIONS)
--------------------------------------------------------------------------------
[0.00842 s] killed by test_attributes (test___future__.FutureTest)

   - [# 192] SDL __future__: 
--------------------------------------------------------------------------------
  140: generator_stop = _Feature((3, 5, 0, 'beta', 1), 
  141:     (3, 7, 0, 'alpha', 0), 
  142:     CO_FUTURE_GENERATOR_STOP)
  143: 
- 144: annotations = _Feature((3, 7, 0, 'beta', 1), 
- 145:     (4, 0, 0, 'alpha', 0), 
- 146:     CO_FUTURE_ANNOTATIONS)
+ 144: pass
--------------------------------------------------------------------------------
[0.00867 s] killed by test_attributes (test___future__.FutureTest)

   - [# 196] SVD __future__: 
--------------------------------------------------------------------------------
   88: 
   89:         This is a 5-tuple, of the same form as sys.version_info.
   90:         '''
   91:         
-  92:         return self.optional
+  92:         return optional
   93:     
   94:     def getMandatoryRelease(self):
   95:         '''Return release in which this feature will become mandatory.
   96: 
--------------------------------------------------------------------------------
[0.00836 s] killed by test_attributes (test___future__.FutureTest)

   - [# 197] SVD __future__: 
--------------------------------------------------------------------------------
   97:         This is a 5-tuple, of the same form as sys.version_info, or, if
   98:         the feature was dropped, is None.
   99:         '''
  100:         
- 101:         return self.mandatory
+ 101:         return mandatory
  102:     
  103:     def __repr__(self):
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
--------------------------------------------------------------------------------
[0.00898 s] killed by test_attributes (test___future__.FutureTest)

   - [# 198] SVD __future__: 
--------------------------------------------------------------------------------
  100:         
  101:         return self.mandatory
  102:     
  103:     def __repr__(self):
- 104:         return '_Feature' + repr((self.optional, \
+ 104:         return '_Feature' + repr((optional, \
  105:             self.mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
--------------------------------------------------------------------------------
[0.00786 s] survived

   - [# 199] SVD __future__: 
--------------------------------------------------------------------------------
  101:         return self.mandatory
  102:     
  103:     def __repr__(self):
  104:         return '_Feature' + repr((self.optional, \
- 105:             self.mandatory, \
+ 105:             mandatory, \
  106:             self.compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
--------------------------------------------------------------------------------
[0.00812 s] survived

   - [# 200] SVD __future__: 
--------------------------------------------------------------------------------
  102:     
  103:     def __repr__(self):
  104:         return '_Feature' + repr((self.optional, \
  105:             self.mandatory, \
- 106:             self.compiler_flag))
+ 106:             compiler_flag))
  107: 
  108: nested_scopes = _Feature((2, 1, 0, 'beta', 1), 
  109:     (2, 2, 0, 'alpha', 0), 
  110:     CO_NESTED)
--------------------------------------------------------------------------------
[0.00803 s] survived
